{
  "model_type": "t5",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_model": 512,
  "d_kv": 64,
  "d_ff": 2048,
  "num_layers": 6,
  "num_decoder_layers": 6,
  "num_heads": 8,
  "relative_attention_num_buckets": 32,
  "dropout_rate": 0.1,
  "layer_norm_epsilon": 1e-06,
  "initializer_factor": 1.0,
  "feed_forward_proj": "relu",
  "is_encoder_decoder": true,
  "decoder_start_token_id": 0,
  "pad_token_id": 0,
  "eos_token_id": 1
}